[
{"title": "German Auto Sport", "url": "https://www.yelp.com/biz/german-auto-sport-berkeley", "id": "german-auto-sport-berkeley", "business_image_url": "https://s3-media0.fl.yelpcdn.com/bphoto/AsyO7-4uRjYHJhtanwAxTw/ls.jpg", "website": "/biz_redir?url=https%3A%2F%2Fwww.bmwrepairberkeley.com&website_link_type=website&src_bizid=JG29Hnn_eQcyV98nP4D_7A&cachebuster=1601392421&s=76c531b2440190c7670c57f6c8e3ab2349c8c586fb16a4ecf14b621887fc4cca", "phone_number": "(510) 525-6000", "location": {"address1": "2396 San Pablo Ave", "city": "Berkeley", "zip_code": "94702", "state": "CA"}, "rating": "4.5 star rating", "reviews": "198 reviews", "categories": ["Auto Repair", "Auto Parts & Supplies"], "schedule": {"Mon": "8:00 am - 5:00 pm", "Tue": "8:00 am - 5:00 pm", "Wed": "8:00 am - 5:00 pm", "Thu": "8:00 am - 5:00 pm", "Fri": "8:00 am - 5:00 pm", "Sat": "Closed", "Sun": "Closed"}, "read_more": {"Specialties": "Our auto mechanics are highly-trained experts who truly have a passion for auto repair services. Our team is often capable of fixing auto repair issues that other auto repair service centers might not catch. The incredibly friendly team at German Auto Sports takes great pride in having earned so many long-term and loyal customers over the years because our deep commitment to first-rate auto repair and customer service just can't be rivaled. We service and repair Volkswagen, Audi, BMW, MINI Cooper, Porsche, and Mercedes vehicles.", "History": "Established in 1977.We were first salvage business in Berkeley because of the beloved 2002's and such when they were fresh of the assembly line. We have a vast knowledge of BMW's ins and outs, with that said not much illudes us. We offer more of a hands on approach to automotive repair with extensive explanation of needed repairs with visual aids if needed. We feel that most problems people have with automotive repair shops is the lack of clear communication BEFORE the work begins, not after. We also have begun our mastery of the MINI line of vehicles with over 300 combined hours of training directly from BMW. Next time you have a service light on or a brake light out, come by and give us a shot and we will do our best to make you a client for life. Chris and crew.", "Meet the Business Owner": "It all started with a 7mm wrench and the words from my dad, \"Hey kiddo, gimme a hand\" The rest is history. That brake bleeding procedure would be the first of many to come. Life has always challenged me with school issues and family strain yet working on cars allowed me that needed escape. Nothing is more rewarding as fixing something that \"couldn't be fixed\", nothing. That is how we still do things, I constantly strive for the challenging work and the \"cant be done\" jobs because that's what makes the day interesting. Every day is a dream come true and I try to live it to the fullest."}, "amenitites_and_more": "Accepts Credit Cards, Free Wi-Fi, Gender Neutral Restrooms, "}
]